Repository: Motiejus/git-lithuanian-translation
Catalog: git/*.po
Languages: lt

source: forced update
lt: priverstinis atnaujinimas

source: (non-fast-forward)
lt: (netiesinis suliejimas)

source: cannot open %s: %s
lt: negalima atidaryti %s: %s

source: From %.*s
lt: Nuo: %.*s

source: some local refs could not be updated; try running 'git remote prune %s' to remove any old, conflicting branches
lt: kai kurios vietinės nuroodos negalėjo būti atnaujintos; bandyk leisti 'git remote prune %s' nodėdamas išmesti senas, konfliktuojančias šakas

source: (%s will become dangling)
lt: (%s pataps karojantis)

source: (%s has become dangling)
lt: (%s patapo karojantis)

source: [deleted]
lt: [ištrinta]

source: (none)
lt: (joks)

source: Refusing to fetch into current branch %s of non-bare repository
lt: Atsisakoma siųsti į dabartinę ne plikos saugyklos šaką %s

source: Don't know how to fetch from %s
lt: Nežinau, kaip siųstis iš %s

source: Option "%s" value "%s" is not valid for %s
lt: Parinkties "%s" reikšmė "%s" nevalidi %s

source: Option "%s" is ignored for %s
lt: Parinktis "%s" ignoruojama %s

source: Fetching %s
lt: Siunčiama %s

source: Could not fetch %s
lt: Nepavyko atsiųsti %s

source: No remote repository specified. Please, specify either a URL or a remote name from which new revisions should be fetched.
lt: Nenurodyta jokia nuotolinė saugykla. Prašome, nurodykite arba URL arba nuotolinė vardą, iš kurio bus siunčiamos naujos revizijos.

source: You need to specify a tag name.
lt: Turite nurodyti žymos vardą.

source: fetch --all does not take a repository argument
lt: fetch --all nereikalingas saugyklos argumentas

source: fetch --all does not make sense with refspecs
lt: fetch --all neturi prasmės su nuorodomis

source: No such remote or remote group: %s
lt: Nėra tokio nuotolinio arba nuotolinės grupės: %s

source: Fetching a group and specifying refspecs does not make sense
lt: Grupės siuntimas ir refspecs nurodymas neturi prasmės

source: Invalid %s: '%s'
lt: Nevalidus %s: '%s'

source: Too many options specified
lt: Nurodyta per daug parinkčių

source: insanely long object directory %.*s
lt: beprotiškai ilgas objekto katalogas %.*s

source: Auto packing the repository for optimum performance.
lt: Saugykla automatiškai pakuojama optimialiam našumui.

source: There are too many unreachable loose objects; run 'git prune' to remove them.
lt: Per daug nepasiekiamų palaidų objektų; leiskite 'git prune' norėdami juos išmesti.

source: grep: failed to create thread: %s
lt: grep: nepavyko sukurti gijos: %s

source: '%s': unable to read %s
lt: '%s': negalėjome skaityti %s

source: '%s': short read %s
lt: '%s' : trumpas skaitymas %s

source: Failed to chdir: %s
lt: Nepavyko chdir: %s

source: unable to read tree (%s)
lt: negalima perskaityti medžio (%s)

source: unable to grep from object of type %s
lt: negalima leisti grep %s tipo objektui

source: switch `%c' expects a numerical value
lt: jungiklis `%c' tikisi skaitinės reikšmės

source: cannot open '%s'
lt: negalima atidaryti '%s'

source: bad object %s
lt: blogas objektas %s

source: --open-files-in-pager only works on the worktree
lt: --open-files-in-pager veikia tik darbiniame medyje

source: both --cached and trees are given.
lt: abu --cached ir medžiai duoti.

source: Could not make %s writable by group
lt: Nepavyko %s padaryti rašomo grupei

source: insanely long template name %s
lt: beprotiškai ilgas šablono vardas %s

source: insanely long symlink %s
lt: beprotiškai ilga simbolinė nuoroda %s

source: ignoring template %s
lt: ignoruojamas šablonas %s

source: insanely long template path %s
lt: beprotiškai ilgas šablono kelias %s

source: templates not found %s
lt: nerasti šablonai %s

source: not copying templates of a wrong format version %d from '%s'
lt: nekopijuojami blogo formato %d versijos šablonai iš '%s'

source: insane git directory %s
lt: beprotiškas git katalogas %s

source: %s%s Git repository in %s%s
lt: %s%s Git saugykla %s%s

source: Reinitialized existing
lt: Perkurta esama

source: Initialized empty
lt: Sukurta tuščia

source: shared
lt: bendrinta

source: cannot tell cwd
lt: negaliu pasakyti cwd

source: cannot mkdir %s
lt: negaliu sukurti katalogo %s

source: cannot chdir to %s
lt: negaliu chdir į %s

source: %s (or --work-tree=<directory>) not allowed without specifying %s (or --git-dir=<directory>)
lt: %s (arba --work-tree=<directory>) neleidžiamas nenurodant %s (arba --git-dir=<katalogas>)

source: Cannot access current working directory
lt: Negaliu prieiti prie darbinio katalogo

source: Cannot access work tree '%s'
lt: Negaliu prieiti darbinio medžio '%s'

source: Final output: %d %s
lt: Galutinė išvestis: %d %s

source: revision walk setup failed
lt: revizijų vaikščiojimo nusistatymas nepavyko

source: Could not read object %s
lt: Objekto %s skaitymas negalimas

source: Unknown type: %d
lt: Neatpažintas tipas: %d

source: format.headers without value
lt: format.headers be reikšmės

source: name of output directory is too long
lt: išvesties katalogo vardas per ilgas

source: Cannot open patch file %s
lt: Nepavyko atidaryti lopo failo

source: Need exactly one range.
lt: Reikia tiksliai vieno intervalo.

source: Not a range.
lt: Ne intervalas.

source: Could not extract email from committer identity.
lt: Nepavyko gauti el. pašto adreso iš įkelėjo tapatybės.

source: insane in-reply-to: %s
lt: beprotiškas in-reply-to: %s

source: Two output directories?
lt: Du išvesties katalogai?

source: bogus committer info %s
lt: klaidinga įkelėjo informacija %s

source: -n and -k are mutually exclusive.
lt: -n ir -k yra tarpusavyje negalimi.

source: --subject-prefix and -k are mutually exclusive.
lt: --subject-prefix ir -k yra tarpusavyje negalimi.

source: unrecognized argument: %s
lt: neatpažintas argumentas: %s

source: --name-only does not make sense
lt: --name-only neturi prasmės

source: --name-status does not make sense
lt: --name-status neturi prasmės

source: --check does not make sense
lt: --check neturi prasmės

source: standard output, or directory, which one?
lt: standartinė išvestis, ar katalogas, kuris?

source: Could not create directory '%s'
lt: Negalėjome sukurti katalogo '%s'

source: Failed to create output files
lt: Nepavyko sukurti išvesties failų

source: Could not find a tracked remote branch, please specify <upstream> manually.
lt: Nepavyko rasti sekamos nuotolinės šakos, prašome nurodyti <upstream> rankiniu būdu.

source: Unknown commit %s
lt: Nežinomas fiksavimas %s

source: switch `m' requires a value
lt: jungikliui „m“ reikia reikšmės

source: Could not find merge strategy '%s'.
lt: Suliejimo strategija '%s' nerasta.

source: Available strategies are:
lt: Galimos strategijos:

source: Available custom strategies are:
lt: Galimos specialios strategijos:

source: could not run stash.
lt: nepavyko paleisti ?

source: not a valid object: %s
lt: nevalidus objektas: %s

source: read-tree failed
lt: read-tree nepavyko

source: Could not write to '%s'
lt: Negalėjome rašyti į '%s'

source: Writing SQUASH_MSG
lt: Rašoma SQUASH_MSG

source: Finishing SQUASH_MSG
lt: Baigiama SQUASH_MSG

source: No merge message -- not updating HEAD
lt: Nėra suliejimo žinutės -- neatnaujinamas HEAD

source: '%s' does not point to a commit
lt: '%s' nerodo į fiksavimą

source: Bad branch.%s.mergeoptions string: %s
lt: Bloga branch.:%s.mergeoptions eilutė: %s

source: %s: negative length %s
lt: %s: neigiamas ilgis %s

source: git write-tree failed to write a tree
lt: git write-tree nepavyko įrašyti medžio

source: failed to read the cache
lt: nepavyko nuskaityti podėlio

source: Unable to write index.
lt: Negalėjome rašyti indekso.

source: Not handling anything other than two heads merge.
lt: Nepalaikome nieko kito kaip dviejų galvų suliejimo.

source: Unknown option for merge-recursive: -X%s
lt: Nežinoma merge-recursive parinktis: -X%s

source: unable to write %s
lt: Negalėjome rašyti %s

source: Could not open '%s' for writing
lt: Nepavyko atidaryti '%s' rašymui

source: Wonderful.
lt: Nuostabu.

source: Automatic merge failed; fix conflicts and then commit the result.
lt: Automatinis suliejimas nepavyko; išspręskite konfliktus ir įkelkite rezultatą.

source: '%s' is not a commit
lt: '%s' yra ne įkėlimas

source: There is no merge to abort (MERGE_HEAD missing).
lt: Nėra suliejimo, kurį reikia nutraukti (trūksta MERGE_HEAD).

source: You have not concluded your merge (MERGE_HEAD exists). Please, commit your changes before you can merge.
lt: Jūs nebaigėte suliejimo (MERGE_HEAD egzistuoja). Prašome, fiksuokite savo pakeitimus prieš suliedami.

source: You cannot combine --squash with --no-ff.
lt: Jūs negalite jungti --squash su --no-ff.

source: You cannot combine --no-ff with --ff-only.
lt: Jūs negalite jungti --no-ff su -ff-only.

source: Can merge only exactly one commit into empty head
lt: Galima lieti lygiai vieną fiksavimą į tuščią galvą

source: %s - not something we can merge
lt: %s - ne kažkas ką mes galime lieti

source: Updating %s..%s
lt: Atnaujiname %s..%s

source: Trying really trivial in-index merge...
lt: Bandome tikrai trivialų indeksinį liejimą...

source: Nope.
lt: Ne.

source: Not possible to fast-forward, aborting.
lt: Neįmanoma tiesiškai sulieti, nutraukiama.

source: Rewinding the tree to pristine...
lt: Atstatome medį į nesugadintą...

source: Trying merge strategy %s...
lt: Bandoma liejimo strategija %s...

source: No merge strategy handled the merge.
lt: Nei vienai liejimo strategijai nepavyko sulieti.

source: Merge with strategy %s failed.
lt: Liejimas su strategija %s nepavyko.

source: Using the %s to prepare resolving by hand.
lt: Naudojame %s ruošdami rankinį sprendimą.

source: Automatic merge went well; stopped before committing as requested
lt: Automatinis suliejimas pavyko; sustabdyta prieš fiksavimą kaip reikalauta

source: Checking rename of '%s' to '%s'
lt: Tikrinamas '%s' pervadinimas į '%s'

source: bad source
lt: bloga pradžia

source: can not move directory into itself
lt: negalima perkelti katalogo į save patį

source: cannot move directory over file
lt: negalima perkelti katalogo ant failo

source: Huh? %.*s is in index?
lt: Huh? %.*s yra indekse?

source: source directory is empty
lt: pradinis katalogas yra tuščias

source: not under version control
lt: neversijuojamas

source: destination exists
lt: paskirtis egzistuoja

source: %s; will overwrite!
lt: %s; perrašys!

source: Cannot overwrite
lt: Negalima užrašyti ant viršaus

source: multiple sources for the same target
lt: keletas pradinių tam pačiam tikslui

source: %s, source=%s, destination=%s
lt: %s, šaltinis=%s, paskirtis=%s

source: Renaming %s to %s
lt: Pervadiname %s į %s

source: renaming '%s' failed
lt: '%s' pervadinimas nepavyko

source: unable to start 'show' for object '%s'
lt: negalima paleisti 'show' objektui '%s'

source: failed to close pipe to 'show' for object '%s'
lt: nepavyko uždaryti kanalo 'show' objektui '%s'

source: failed to finish 'show' for object '%s'
lt: nepavyko pabaigti 'show' objektui '%s'

source: could not create file '%s'
lt: negalima sukurti failo '%s'

source: Please supply the note contents using either -m or -F option
lt: Prašome nurodyti žymos turinį naudodami -m arba -F parinktis

source: Removing note for object %s
lt: Išmetame žymą objektui %s

source: unable to write note object
lt: negalima rašyti žymos objekto

source: The note contents has been left in %s
lt: Žymos turinys paliktas %s

source: cannot read '%s'
lt: negalima skaityti '%s'

source: could not open or read '%s'
lt: negalima atidaryti arba skaityti '%s'

source: Failed to resolve '%s' as a valid ref.
lt: Nepavyko nustatyti '%s' kaip validžios nuorodos.

source: Failed to read object '%s'.
lt: Nepavyko nuskaityti objekto '%s'.

source: Cannot commit uninitialized/unreferenced notes tree
lt: Negalima fiksuoti neinicijuoto/nenuorodinio žymų medžio

source: Bad notes.rewriteMode value: '%s'
lt: Bloga notes.rewriteMode reikšmė: '%s'

source: Refusing to rewrite notes in %s (outside of refs/notes/)
lt: Atsisakoma perrašyti žymas %s (už refs/notes/)

source: Bad %s value: '%s'
lt: Bloga %s reikšmė: '%s'

source: Malformed input line: '%s'.
lt: Blogai suformuota įvesties eilutė: '%s'.

source: Failed to copy notes from '%s' to '%s'
lt: Nepavyko nukopijuoti žymų iš '%s' į '%s'

source: too many parameters
lt: per daug parametrų

source: No note found for object %s.
lt: Nerasta jokia žyma objektui %s.

source: Cannot add notes. Found existing notes for object %s. Use '-f' to overwrite existing notes
lt: Žymų pridėjimas negalimas. Rasta egzistuojančių žymų objektui %s. Naudokite '-f' norėdami perrašyti egzistuojančias žymas

source: Overwriting existing notes for object %s
lt: Perrašome egzistuojančias pastabas objektui %s

source: too few parameters
lt: per mažai parametrų

source: Cannot copy notes. Found existing notes for object %s. Use '-f' to overwrite existing notes
lt: Pastabų kopijavimas negalimas.

source: Missing notes on source object %s. Cannot copy.
lt: Trūksta žymos šaltinio objektui %s. Negalima kopijuoti.

source: The -m/-F/-c/-C options have been deprecated for the 'edit' subcommand. Please use 'git notes add -f -m/-F/-c/-C' instead.
lt: Parinktis -m/-F/-c/-C pakeitė 'edit' subkomanda. Prašome vietoje to naudoti 'git notes add -f -m/-F/-c/-C'.

source: Object %s has no note
lt: Objektas %s neturi žymos

source: Unknown subcommand: %s
lt: Nežinoma subkomanda: %s

source: tag shorthand without <tag>
lt: žymos sutrumpinimas be <tag>

source: --delete only accepts plain target ref names
lt: --delete priima tik grynuosius nuorodų vardus

source: You are not currently on a branch. To push the history leading to the current (detached HEAD) state now, use git push %s HEAD:<name-of-remote-branch>
lt: Jūs dabar nesate šakoje. Norėdami sustumti istoriją, vedančią į dabartinę (atjungto HEAD) padėtį, naudokite git push %s HEAD:<nuotolinės-šakos-vardas>

source: The current branch %s has no upstream branch. To push the current branch and set the remote as upstream, use git push --set-upstream %s %s
lt: Dabartinė šaka %s neturi bazinės šakos. Norėdami sustumti dabartinę šaką ir nustatyti nuotolinę kaip bazinę, naudokite git push --set-upstream %s %s

source: The current branch %s has multiple upstream branches, refusing to push.
lt: Dabartinė šaka %s turi keletą bazinių šakų, atsisakome stumti.

source: You didn't specify any refspecs to push, and push.default is "nothing".
lt: Jūs nenurodėte jokių stūmimo nuorodų, ir push.default yra "niekas".

source: Pushing to %s
lt: Stumiame į %s

source: failed to push some refs to '%s'
lt: nepavyko sustumti kai kurių nuorodų į '%s'

source: bad repository '%s'
lt: bloga saugykla '%s'

source: No configured push destination. Either specify the URL from the command-line or configure a remote repository using git remote add <name> <url> and then push using the remote name git push <name>
lt: Nenustatytas sustūmimo kelias. Nurodykite URL komandinėje eilutėje arba sukonifigūruokite nuotolinę saugyklą naudodami git remote add <vardas> <url> ir tuomet sustumkite naudodami nuotolinį pavadinimą git push <vardas>

source: --all and --tags are incompatible
lt: --all ir --tags yra nesuderinami

source: --all can't be combined with refspecs
lt: --all negali būti kombinuotas su nuorodomis

source: --mirror and --tags are incompatible
lt: --mirror ir --tags yra nesuderinami

source: --mirror can't be combined with refspecs
lt: --mirror negali būti kombinuotas su nuorodomis

source: --all and --mirror are incompatible
lt: --all ir --mirror yra nesuderinami

source: --delete is incompatible with --all, --mirror and --tags
lt: --delete yra nesuderinamas su --all, --mirror ir --tags

source: --delete doesn't make sense without any refs
lt: --delete neturi prasmės be nuorodų

source: mixed
lt: maišyto

source: soft
lt: minkšto

source: hard
lt: kieto

source: merge
lt: suliejimo

source: keep
lt: paliekamo

source: You do not have a valid HEAD.
lt: Jūs neturite validaus HEAD.

source: Failed to find tree of HEAD.
lt: Nepavyko rasti HEAD medžio.

source: Failed to find tree of %s.
lt: Nepavyko rasti %s medžio.

source: Could not write new index file.
lt: Negalėjome įrašyti naujo indekso failo.

source: HEAD is now at %s
lt: HEAD yra dabar %s

source: Could not read index
lt: Negalėjome perskaityti indekso

source: Unstaged changes after reset:
lt: Neįsiminti pakeitimai po atstatymo:

source: Cannot do a %s reset in the middle of a merge.
lt: Negalima daryti %s atstatymo viduryje suliejimo.

source: Could not parse object '%s'.
lt: Negalėjome išanalizuoti objekto '%s'.

source: --patch is incompatible with --{hard,mixed,soft}
lt: --patch yra nesuderinamas su --{hard,mixed,soft}
