Repository: Motiejus/git-lithuanian-translation
Catalog: git/*.po
Languages: lt

source: failed write to rev-list: %s
lt: nepavyko įrašyti į rev-list: %s

source: failed to close rev-list's stdin: %s
lt: nepavyko uždaryti rev-list'o standartinės įvesties: %s

source: Unmerged paths:
lt: Nesujungti keliai:

source: (use "git reset %s <file>..." to unstage)
lt: (naudokite "git reset %s <file>..." norėdami pamiršti)

source: (use "git rm --cached <file>..." to unstage)
lt: (naudokite "git rm --cached <file> ..." norėdami pamiršti)

source: (use "git add/rm <file>..." as appropriate to mark resolution)
lt: (naudokite "git add/rm <file>..." pasirinktinai norėdami pažymėti sprendimą)

source: Changes to be committed:
lt: Pakeitimai įkėlimui:

source: Changes not staged for commit:
lt: Pakeitimai nepridėti įkėlimui:

source: (use "git add <file>..." to update what will be committed)
lt: (naudokite "git add <file>..." atnaujinti tam, kas bus įkeliama)

source: (use "git add/rm <file>..." to update what will be committed)
lt: (naudokite "git add/rm <file>..." atnaujinti tam, kas bus įkeliama)

source: (use "git checkout -- <file>..." to discard changes in working directory)
lt: (naudokite "git checkout -- <file>..." atmesti pakeitimus darbiniame kataloge)

source: (commit or discard the untracked or modified content in submodules)
lt: (įkelti arba atmesti keistą turinį submoduliuose)

source: %s files:
lt: %s failai:

source: (use "git %s <file>..." to include in what will be committed)
lt: (naudokite "git %s <file>..." įtraukti tai, kas bus įkeliama)

source: bug
lt: klaida

source: both deleted:
lt: abu ištrinti:

source: added by us:
lt: mūsų pridėti:

source: deleted by them:
lt: jų išmesti:

source: added by them:
lt: jų pridėti:

source: deleted by us:
lt: mūsų išmesti:

source: both added:
lt: abu pridėti:

source: both modified:
lt: abu pakeisti:

source: new commits,
lt: naujos revizijos,

source: modified content,
lt: pakeistas turinys,

source: untracked content,
lt: nesekamas turinys,

source: new file: %s
lt: naujas failas: %s

source: copied: %s -> %s
lt: kopijuotas: %s -> %s

source: deleted: %s
lt: išmestas: %s

source: modified: %s
lt: pakeistas: %s

source: renamed: %s -> %s
lt: pakeistas: %s -> %s

source: typechange: %s
lt: tipo pakeitimas: %s

source: unknown: %s
lt: nežinomas: %s

source: unmerged: %s
lt: neprijungtas: %s

source: bug: unhandled diff status %c
lt: klaida: neapdorojamas diff statusas %c

source: On branch
lt: Šakoje

source: Not currently on any branch.
lt: Jokioje šakoje.

source: Initial commit
lt: Pradinis įkėlimas

source: Untracked
lt: Nesekamas

source: Ignored
lt: Ignoruojamas

source: Untracked files not listed%s
lt: Nesekami failai nerodomi%s

source: (use -u option to show untracked files)
lt: (naudokite -u parinktį rodyti nesekamus failus)

source: No changes
lt: Nėra pakeitimų

source: no changes added to commit%s
lt: nepridėta pakeitimų į įkėlimą %s

source: (use "git add" and/or "git commit -a")
lt: (naudokite "git add " ir/arba "git commit -a")

source: nothing added to commit but untracked files present%s
lt: niekas nepridėta į reviziją bet nesekami failai egzistuoja%s

source: (use "git add" to track)
lt: (naudokite "git add" norėdami sekti)

source: nothing to commit%s
lt: nieko keltino%s

source: (create/copy files and use "git add" to track)
lt: (kurkite/kopijuokite failus ir naudokite "git add" sekti)

source: (use -u to show untracked files)
lt: (naudokite -u parintį rodyti nesekamiems failams)

source: (working directory clean)
lt: (darbinis katalogas švarus)

source: HEAD (no branch)
lt: HEAD (nėra šakos)

source: Initial commit on
lt: Pirmasis įkėlimas

source: behind
lt: už

source: ahead
lt: prieš

source: , behind
lt: , už

source: unexpected diff status %c
lt: netikėtas diff statusas %c

source: updating files failed
lt: failų atnaujinimas nepavyko

source: remove '%s'
lt: išmesti '%s'

source: Path '%s' is in submodule '%.*s'
lt: Kelias '%s' yra submodulyje '%.*s'

source: Unstaged changes after refreshing the index:
lt: Neįsiminti pakeitimai po indekso atnaujinimo:

source: pathspec '%s' did not match any files
lt: kelio specifikacija '%s' neatitiko jokių failų

source: '%s' is beyond a symbolic link
lt: '%s' yra už simbolinės nuorodos

source: Could not read the index
lt: Negalėjome perskaityti indekso

source: Could not open '%s' for writing.
lt: Negalėjome atidaryti '%s' rašymui.

source: Could not write patch
lt: Negalėjome įrašyti lopo

source: Could not stat '%s'
lt: Negalėjome gauti '%s' statuso

source: Empty patch. Aborted.
lt: Tuščias lopas. Nutraukta.

source: Could not apply '%s'
lt: Negalėjome pritaikyti '%s'

source: The following paths are ignored by one of your .gitignore files:
lt: Šie keliai ignoruojami vienu iš jūsų .gitignore failų:

source: Use -f if you really want to add them.
lt: Naudokite -f jei tikrai norite juos pridėti.

source: no files added
lt: nepridėta jokių failų

source: adding files failed
lt: failų pridėjimas nepavyko

source: -A and -u are mutually incompatible
lt: -A ir -u yra tarpusavyje nesuderinami

source: Option --ignore-missing can only be used together with --dry-run
lt: Parinktis --ignore-missing gali būti vartojama tik kartu su --dry-run

source: Nothing specified, nothing added.
lt: Nieko nenurodyta, nieko nepridėta.

source: Maybe you wanted to say 'git add .'?
lt: Gal norėjai pasakyti 'git add .'?

source: index file corrupt
lt: indeksas pažeistas

source: Unable to write new index file
lt: Negalėjome įrašyti naujo indekso failo

source: could not create archive file '%s'
lt: negalėjome sukurti archyvo '%s'

source: could not redirect output
lt: negalėjome peradresuoti išvesties

source: git archive: Remote with no URL
lt: git archive: Nuotolinis be URL

source: git archive: expected ACK/NAK, got EOF
lt: git archive: tikėtasi ACK/NAK, gauta EOF

source: git archive: protocol error
lt: git archive: protokolo klaida

source: git archive: expected a flush
lt: git archive: tikėtasi priverstinio įrašymo komandos

source: deleting branch '%s' that has been merged to '%s', but not yet merged to HEAD.
lt: išmetama šaka '%s', kuri buvo sujungta su '%s', bet dar nesujungta su HEAD.

source: not deleting branch '%s' that is not yet merged to '%s', even though it is merged to HEAD.
lt: neišmetama šaka '%s', kuri dar nebuvo sujungta su '%s', nors ji sujungta su HEAD.

source: remote
lt: nuotolinė

source: cannot use -a with -d
lt: negalima naudoti -a su -d

source: Couldn't look up commit object for HEAD
lt: Nepavyko surasti revizijos objekto HEAD

source: Cannot delete the branch '%s' which you are currently on.
lt: Negalima išmesti šakos '%s', kurioje dabar esi.

source: %sbranch '%s' not found.
lt: %sšaka '%s' nerasta.

source: Couldn't look up commit object for '%s'
lt: Nepavyko surasti revizijos objekto '%s'

source: The branch '%s' is not fully merged. If you are sure you want to delete it, run 'git branch -D %s'.
lt: Šaka '%s' yra nepilnai sulieta. Jei esi tikras, kad nori ją ištrinti, leisk 'git branch -D %s'.

source: Error deleting %sbranch '%s'
lt: Klaida trinant %sšaką '%s'

source: Deleted %sbranch %s (was %s).
lt: Ištrinta %sšaka %s (buvo %s).

source: Update of config-file failed
lt: Konfigūracinio failo atnaujinimas nepavyko

source: branch '%s' does not point at a commit
lt: šaka '%s' nerodo į fiksavimą

source: behind %d]
lt: už %d]

source: ahead %d]
lt: priešais %d]

source: ahead %d, behind %d]
lt: už %d, priešais %d]

source: (no branch)
lt: (ne šakoje)

source: some refs could not be read
lt: nepavyko perskaityti kai kurių nuorodų

source: cannot rename the current branch while not on any.
lt: negalima pervadinti dabartinės šakos kol esate jokioje.

source: Invalid branch name: '%s'
lt: Nevalidus šakos pavadinimas: '%s'

source: Branch rename failed
lt: Šakos pervadinimas nepavyko

source: Renamed a misnamed branch '%s' away
lt: Atgal pervadinome blogai pavadintą šaką '%s'

source: Branch renamed to %s, but HEAD is not updated!
lt: Šaka pervadinta į %s, bet HEAD neatnaujintas!

source: Branch is renamed, but update of config-file failed
lt: Šaka pervadinta, bet konfigūracinio failo atnaujinimas nepavyko

source: malformed object name %s
lt: blogai suformuotas objekto vardas %s

source: Failed to resolve HEAD as a valid ref.
lt: Nepavyko nustatyti HEAD kaip validžios nuorodos

source: HEAD not found below refs/heads!
lt: HEAD nerasta po refs/heads!

source: -a and -r options to 'git branch' do not make sense with a branch name
lt: 'git branch' parinktys -a ir -r neturi prasmės su šakos pavadinimu

source: %s is okay
lt: %s yra geras

source: Need a repository to create a bundle.
lt: Reikia saugyklos, kad galėtume sukurti rinkinį.

source: Need a repository to unbundle.
lt: Reikia saugyklos norint išrinkti rinkinį.

source: path '%s' does not have our version
lt: kelias '%s' neturi mūsų versijos

source: path '%s' does not have their version
lt: kelias '%s' neturi jų versijos

source: path '%s' does not have all three versions
lt: kelias '%s' neturi visų trijų versijų

source: path '%s' does not have all 3 versions
lt: kelias '%s' neturi visų 3 versijų

source: path '%s': cannot merge
lt: kelias '%s': negalima sulieti

source: Unable to add merge result for '%s'
lt: Negalima pridėti liejimo rezultato '%s'

source: make_cache_entry failed for path '%s'
lt: make_cache_entry nepavyko keliui '%s'

source: corrupt index file
lt: pažeistas indekso failas

source: path '%s' is unmerged
lt: kelias '%s' yra nesulietas

source: unable to write new index file
lt: negalima įrašyti naujo indekso failo

source: diff_setup_done failed
lt: diff_setup_done nepavyko

source: you need to resolve your current index first
lt: jums pirma reikia nustatyti jūsų dabartinį indeksą

source: Can not do reflog for '%s'
lt: Negalima daryti reflog '%s'

source: HEAD is now at
lt: HEAD dabar yra

source: Already on '%s'
lt: Jau '%s'

source: Switched to and reset branch '%s'
lt: Perėjome į ir atstatėme šaką '%s'

source: Switched to a new branch '%s'
lt: Perjungėme į naują šaką '%s'

source: Switched to branch '%s'
lt: Perjungėme į šaką '%s'

source: internal error in revision walk
lt: vidinė klaida vaikštant po revizijas

source: Previous HEAD position was
lt: Praeita HEAD vieta buvo

source: You are on a branch yet to be born
lt: Esi šakoje, kuri dar tik gims

source: invalid reference: %s
lt: nevalidi nuoroda: %s

source: reference is not a tree: %s
lt: nuoroda nėra medis: %s

source: -B cannot be used with -b
lt: -B negali būti vartojamas su -b

source: --patch is incompatible with all other options
lt: --patch yra nesuderinamas su visomis kitomis parinktimis

source: --track needs a branch name
lt: --track reikalauja šakos vardo

source: Missing branch name; try -b
lt: Trūksta šakos vardo; bandyk -b

source: --orphan and -b|-B are mutually exclusive
lt: --orphan ir -b|-B yra tarpusavyje negalimi

source: --orphan cannot be used with -t
lt: --orhphan negali būti vartojamas su -t

source: git checkout: -f and -m are incompatible
lt: git checkout: -f ir -m yra nesuderinami

source: git checkout: updating paths is incompatible with switching branches. Did you intend to checkout '%s' which can not be resolved as commit?
lt: git checkout: kelių atnaujinimas nesuderinamas su šakų perjungimu. Ar tu norėjai išsikelti '%s', kuris negali būti nustatytas kaip įkėlimas?

source: git checkout: updating paths is incompatible with switching branches.
lt: git checkout: kelių atnaujinimas ir šakų keitimas nesuderinami.

source: git checkout: --ours/--theirs, --force and --merge are incompatible when checking out of the index.
lt: git checkout: --ours/--theirs, --force ir --merge yra nesuderinami kai paimama iš indekso.

source: Cannot switch branch to a non-commit.
lt: Negalima keisti šakos į ne-reviziją.

source: --ours/--theirs is incompatible with switching branches.
lt: --ours/--theirs nesuderinama kai perjungiamos šakos.

source: -x and -X cannot be used together
lt: -x ir -X negali būti vartojamas kartu

source: clean.requireForce set to true and neither -n nor -f given; refusing to clean
lt: clean.requireForce pažymėtas "true" ir nei -n, nei -f duotas; atsisakome valyti

source: clean.requireForce defaults to true and neither -n nor -f given; refusing to clean
lt: clean.requireForce pagal nutylėjimą "true" ir nei -n, nei -f duotas; atsisakome valyti

source: Would remove %s
lt: Pašalintų %s

source: Removing %s
lt: Pašalinama %s

source: failed to remove %s
lt: nepavyko pašalinti %s

source: Would not remove %s
lt: Nepašalintų %s

source: Not removing %s
lt: Nešalinama %s

source: reference repository '%s' is not a local directory.
lt: nurodyta saugykla '%s' nėra vietinis katalogas.

source: failed to open '%s'
lt: nepavyko atidaryti '%s'

source: failed to create directory '%s'
lt: nepavyko sukurti katalogo '%s'

source: failed to stat '%s'
lt: nepavyko gauti '%s' statuso

source: %s exists and is not a directory
lt: %s egzistuoja ir yra ne katalogas

source: failed to stat %s
lt: nepavyko nustatyti %s

source: failed to unlink '%s'
lt: nepavyko pašalinti '%s'

source: failed to create link '%s'
lt: nepavyko sukurti nuorodos '%s'

source: failed to copy file to '%s'
lt: nepavyko nukopijuoti failo į '%s'

source: done.
lt: baigta.

source: Too many arguments.
lt: Per daug argumentų.

source: You must specify a repository to clone.
lt: Privalote nurodyti saugyklą klonavimui.

source: --bare and --origin %s options are incompatible.
lt: --bare ir --origin %s parinktys nesuderinamos.

source: repository '%s' does not exist
lt: saugykla '%s' neegzistuoja

source: --depth is ignored in local clones; use file:// instead.
lt: --depth ignoruojamas lokaliuose klonuose; naudok file:// vietoj to.

source: destination path '%s' already exists and is not an empty directory.
lt: paskirties kelias '%s' jau egzistuoja ir yra ne tuščias katalogas

source: working tree '%s' already exists.
lt: darbinis medis '%s' jau egzistuoja.

source: could not create work tree dir '%s'.
lt: negalėjome sukurti darbinio medžio katalogo '%s'.

source: Don't know how to clone %s
lt: Nežinau, kaip klonuoti %s

source: Remote branch %s not found in upstream %s, using HEAD instead
lt: Nuotolinė šaka %s nerasta baziniame %s, naudojame HEAD vietoj to

source: You appear to have cloned an empty repository.
lt: Panašu, kad nuklonavai tuščią saugyklą.

source: remote HEAD refers to nonexistent ref, unable to checkout.
lt: nuotolinis HEAD rodo į neegzistuojančią nuorodą, negalima išsikelti.

source: Your name and email address were configured automatically based on your username and hostname. Please check that they are accurate. You can suppress this message by setting them explicitly: git config --global user.name "Your Name" git config --global user.email you@example.com After doing this, you may fix the identity used for this commit with: git commit --amend --reset-author
lt: Jūsų vardas ir el. pašto adresas buvo sukonfigūruoti automatiškai remiantis jūsų vartotojo ir kompiuterio vardais. Prašau patikrinkite, kad tai yra tikslu. Galite išjungti šią žinutę nustatydami: git config --global user.name "Jūsų Vardas" git config --global user.email jūs@example.com Po šio veiksmo, galite pataisyti savo tapatybę šiai šiam įkėlimui taip: git commit --amend --reset-author

source: You asked to amend the most recent commit, but doing so would make it empty. You can repeat your command with --allow-empty, or you can remove the commit entirely with "git reset HEAD^".
lt: Paprašei pakeisti paskutinę reviziją, bet šis veiksmas ją padarytų tuščia. Gali pakartoti savo komandą su --allow-empty, arba gali ją išvis išmesti su "git reset HEAD^".

source: The previous cherry-pick is now empty, possibly due to conflict resolution. If you wish to commit it anyway, use: git commit --allow-empty Otherwise, please use 'git reset'
lt: Praeitas cherry-pick yra dabar tuščias, gali būti dėl konflikto sprendimo. Jei vis tiek norite fiksuoti, naudokite: git commit --allow-empty Kitu atveju, naudokite 'git reset'

source: failed to unpack HEAD tree object
lt: nepavyko išpakuoti HEAD medžio objekto

source: interactive add failed
lt: interaktyvus pridėjimas nepavyko

source: unable to write new_index file
lt: nepavyko įrašyti naujo indekso failo

source: cannot do a partial commit during a %s.
lt: negalime daryti dalinio įkėlimo per %s.

source: cannot read the index
lt: indekso skaitymas negalimas

source: unable to write temporary index file
lt: laikinojo indekso failo rašymas negalimas

source: invalid commit: %s
lt: nevalidus įkėlimas: %s

source: malformed --author parameter
lt: blogai suformuotas --author parametras

source: Malformed ident string: '%s'
lt: Blogai suformuota paslinkimo eilutė: '%s'

source: could not lookup commit %s
lt: nepavyko rasti revizijos %s

source: (reading log message from standard input)
lt: (skaitoma žinutė iš standartinės įvesties)

source: could not read log from standard input
lt: žurnalo skaitymas iš standartinės įvesties negalimas

source: could not read log file '%s'
lt: negalima skaityti žurnalo failo '%s'

source: commit has empty message
lt: revizija turi tuščią žinutę

source: could not read MERGE_MSG
lt: nepavyko perskaityti MERGE_MSG

source: could not read SQUASH_MSG
lt: nepavyko perskaityti SQUASH_MSG

source: could not read '%s'
lt: nepavyko perskaityti '%s'

source: could not open '%s'
lt: nepavyko atidaryti '%s'

source: could not write commit template
lt: nepavyko daryti revizijos šablono

source: It looks like you may be committing a %s. If this is not correct, please remove the file %s and try again.
lt: Panašu, kad jūs galbūt fiksuojate %s. Jei tai nėra tiesa, prašome pašalinti failą %s ir bandyti dar kartą.

source: Please enter the commit message for your changes.
lt: Prašome įvesti revizijos žinutę savo pakeitimams.

source: Lines starting with '#' will be ignored, and an empty message aborts the commit.
lt: Eilutės prasidedančios '#' bus ignoruotos, ir tuščia revizijos žinutė atšaukia įkėlimą.

source: Lines starting with '#' will be kept; you may remove them yourself if you want to. An empty message aborts the commit.
lt: Eilutės prasidedančios '#' bus laikomos; Galite išmesti jas pats, jei norite. Tuščia revizijos žinutė atšaukia įkėlimą.

source: %sAuthor: %s
lt: %Autorius: %s

source: %sCommitter: %s
lt: %sFiksuotojas: %s

source: Cannot read index
lt: Indekso skaitymas negalimas

source: Error building trees
lt: Klaida generuojant medžius

source: Please supply the message using either -m or -F option.
lt: Prašome pateikti žinutę vartojant -m arba -F parinktis.

source: No existing author found with '%s'
lt: Nerastas egzistuojantis autorius su '%s'

source: Invalid untracked files mode '%s'
lt: Nevalidi nesekamų failų būsena '%s'

source: Using both --reset-author and --author does not make sense
lt: Argumentų --reset-author ir --author vartojimas kartu neturi prasmės

source: You have nothing to amend.
lt: Jūs neturite ko pakeisti.

source: You are in the middle of a %s -- cannot amend.
lt: Jei esate viduryje %s -- negalima naudoti amend

source: Options --squash and --fixup cannot be used together
lt: Parinktys --squash ir --fixup negali būti vartojami kartu

source: Only one of -c/-C/-F/--fixup can be used.
lt: Tik vienas iš -c/-C/-F/--fixup gali būti vartojamas.

source: Option -m cannot be combined with -c/-C/-F/--fixup.
lt: Parinktis -m negali būti jungiama su -c/-C/-F/--fixup.

source: --reset-author can be used only with -C, -c or --amend.
lt: --reset-author gali būti vartojamas tik su -C, -c arba --amend.

source: No paths with --include/--only does not make sense.
lt: Jokie keliai su --include/--only neturi prasmės

source: Clever... amending the last one with dirty index.
lt: Gudrutis... keiti paskutinį su nešvariu indeksu.

source: Explicit paths specified without -i nor -o; assuming --only paths...
lt: Specialiai abibrėžti keliai be -i nei -o; tariame --only keliai...

source: Invalid cleanup mode %s
lt: Nevalidus išvalymo būdas %s

source: Paths with -a does not make sense.
lt: Keliai su -a neturi prasmės.

source: couldn't look up newly created commit
lt: nepavyko rasti naujai sukurtos revizijos

source: could not parse newly created commit
lt: nepavyko išanalizuoti naujai sukurtos revizijos

source: detached HEAD
lt: atjungtas HEAD

source: (root-commit)
lt: (šakininė-revizija)

source: could not parse HEAD commit
lt: nepavyko išanalizuoti HEAD revizijos

source: could not open '%s' for reading
lt: nepavyko atidaryti '%s' skaitymui

source: Corrupt MERGE_HEAD file (%s)
lt: Sugadintas MERGE_HEAD failas (%s)

source: could not read MERGE_MODE
lt: negalima perskaityti MERGE_HEAD

source: could not read commit message: %s
lt: negalima perskaityti revizijos žinutės: %s

source: Aborting commit due to empty commit message.
lt: Nutraukiamas įkėlimas dėl tuščios įkėlimo žinutės.

source: failed to write commit object
lt: nepavyko įrašyti fiksavimo objekto

source: cannot lock HEAD ref
lt: nepavyko užrakinti HEAD nuorodos

source: cannot update HEAD ref
lt: nepavyko atnaujinti HEAD rodyklės

source: Repository has been updated, but unable to write new_index file. Check that disk is not full or quota is not exceeded, and then "git reset HEAD" to recover.
lt: Saugykla buvo atnaujinta, bet nepavyko įrašyti new_index (naujojo indekso) failo. Patikrinkite, ar diskas ne pilnas arba disko kvota neviršyta, ir tuomet "git reset HEAD" atstatymui.

source: annotated tag %s not available
lt: anotuota žymė %s neprieinama

source: annotated tag %s has no embedded name
lt: anotuota žymė %s neturi įterpto vardo

source: tag '%s' is really '%s' here
lt: žymė '%s' iš tikro čia yra '%s'

source: Not a valid object name %s
lt: Nevalidus objekto vardas %s

source: %s is not a valid '%s' object
lt: %s nėra validus '%s' objektas

source: no tag exactly matches '%s'
lt: jokia žymė tiksliai atitinka '%s'

source: searching to describe %s
lt: ieškome apibūdinti %s

source: finished search at %s
lt: paieška baigta %s

source: No annotated tags can describe '%s'. However, there were unannotated tags: try --tags.
lt: Jokia anotuota žymė negali aprašyti '%s'. Tačiau buvo neanotuotų žymių: bandyk --tags.

source: No tags can describe '%s'. Try --always, or create some tags.
lt: Jokia žymė negali paaiškinti '%s'. Bandyk --always, arba sukurk žymių.

source: traversed %lu commits
lt: pereita per %lu įkėlimų

source: more than %i tags found; listed %i most recent gave up search at %s
lt: rasta daugiau nei %i žymių; rodomos %i naujausios nustota ieškoti čia: %s

source: --long is incompatible with --abbrev=0
lt: --long yra nesuderinamas su --abbrev=0

source: No names found, cannot describe anything.
lt: Vardų nerasta, negalima nieko apibūdinti.

source: --dirty is incompatible with committishes
lt: --dirty nesuderinamas su revizijų vardais

source: '%s': not a regular file or symlink
lt: '%s': nei failas, nei simbolinė nuoroda

source: invalid option: %s
lt: nevalidi parinktis: %s

source: Not a git repository
lt: Ne git saugykla

source: invalid object '%s' given.
lt: duotas nevalidus objektas '%s'.

source: more than %d trees given: '%s'
lt: duoti daugiau nei %d medžiai: '%s'

source: more than two blobs given: '%s'
lt: duoti daugiau nei du elementarieji objektai: '%s'

source: unhandled object '%s' given.
lt: duotas neapdorotas objektas: '%s'.

source: Couldn't find remote ref HEAD
lt: Negalėjome rasti nuotolinės nuorodos HEAD

source: object %s not found
lt: objektas %s nerastas

source: [up to date]
lt: [naujausias]

source: ! %-*s %-*s -> %s (can't fetch in current branch)
lt: ! %-*s %-*s -> %s (negalima siųstis dabartinėje šakoje)

source: [rejected]
lt: [atmesta]

source: [tag update]
lt: [žymės atnaujinimas]

source: (unable to update local ref)
lt: (negalėjome atnaujinti vietinės nuorodos)

source: [new tag]
lt: [nauja žymė]

source: [new branch]
lt: [nauja šaka]

source: unable to update local ref
lt: negalėjome atnaujinti vietinės nuorodos
